rocksdb/experiments/M2/results/20260429-020219/budget_on/run_1/db_bench.log
RocksDB:    version 8.11.3
Date:       Wed Apr 29 02:02:26 2026
CPU:        16 * Intel(R) Xeon(R) Gold 5320 CPU @ 2.20GHz
CPUCache:   16384 KB
Set seed to 1777428146313586 because --seed was 0
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Integrated BlobDB: blob cache disabled
Keys:       16 bytes each (+ 0 bytes user-defined timestamp)
Values:     1024 bytes each (512 bytes after compression)
Entries:    5000000
Prefix:    0 bytes
Keys per prefix:    0
RawSize:    4959.1 MB (estimated)
FileSize:   2517.7 MB (estimated)
Write rate: 0 bytes/second
Read rate: 0 ops/second
Compression: NoCompression
Compression sampling rate: 0
Memtablerep: SkipListFactory
Perf Level: 1
------------------------------------------------
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Integrated BlobDB: blob cache disabled
DB path: [rocksdbtest/dbbench]
fillrandom   :       8.401 micros/op 119035 ops/sec 42.004 seconds 5000000 operations;  118.1 MB/s
DB path: [rocksdbtest/dbbench]
overwrite    :      12.565 micros/op 79587 ops/sec 62.824 seconds 5000000 operations;   78.9 MB/s
DB path: [rocksdbtest/dbbench]
overwrite    :      14.020 micros/op 71328 ops/sec 70.098 seconds 5000000 operations;   70.7 MB/s


** Compaction Stats [default] **
Level    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop Rblob(GB) Wblob(GB)
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
  L0      3/0   186.82 MB   0.8      0.0     0.0      0.0      14.6     14.6       0.0   1.0      0.0    490.5     30.48             23.84       240    0.127       0      0       0.0       0.0
  L1     30/1    1.85 GB   7.2     27.2    14.4     12.7      23.6     10.9       0.0   1.6    250.6    218.2    110.97             93.59        18    6.165     27M  3569K       0.0       0.0
  L2     94/2    4.48 GB   1.8     18.4     8.5      9.9      13.8      3.9       0.6   1.6    311.3    233.7     60.42             50.46       124    0.487     18M  4655K       0.0       0.0
 Sum    127/3    6.51 GB   0.0     45.5    22.9     22.6      52.0     29.4       0.6   3.6    230.9    264.0    201.86            167.89       382    0.528     46M  8224K       0.0       0.0
 Int      0/0    0.00 KB   0.0     45.3    22.6     22.6      51.4     28.8       0.6   3.6    231.5    262.9    200.32            166.68       375    0.534     46M  8220K       0.0       0.0

** Compaction Stats [default] **
Priority    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop Rblob(GB) Wblob(GB)
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 Low      0/0    0.00 KB   0.0     45.5    22.9     22.6      37.4     14.8       0.0   0.0    272.0    223.7    171.39            144.05       142    1.207     46M  8224K       0.0       0.0
High      0/0    0.00 KB   0.0      0.0     0.0      0.0      14.6     14.6       0.0   0.0      0.0    490.5     30.48             23.84       240    0.127       0      0       0.0       0.0

Blob file count: 0, total size: 0.0 GB, garbage size: 0.0 GB, space amp: 0.0

Uptime(secs): 174.9 total, 171.9 interval
Flush(GB): cumulative 14.598, interval 14.233
AddFile(GB): cumulative 0.000, interval 0.000
AddFile(Total Files): cumulative 0, interval 0
AddFile(L0 Files): cumulative 0, interval 0
AddFile(Keys): cumulative 0, interval 0
Cumulative compaction: 52.04 GB write, 304.60 MB/s write, 45.52 GB read, 266.47 MB/s read, 201.9 seconds
Interval compaction: 51.43 GB write, 306.33 MB/s write, 45.28 GB read, 269.68 MB/s read, 200.3 seconds
Write Stall (count): cf-l0-file-count-limit-delays-with-ongoing-compaction: 30, cf-l0-file-count-limit-stops-with-ongoing-compaction: 0, l0-file-count-limit-delays: 32, l0-file-count-limit-stops: 0, memtable-limit-delays: 0, memtable-limit-stops: 0, pending-compaction-bytes-delays: 0, pending-compaction-bytes-stops: 0, total-delays: 32, total-stops: 0
interval: 32 total count
Block cache LRUCache@0x55f1c338fdf0#75307 capacity: 32.00 MB seed: 1028020594 usage: 0.09 KB table_size: 1024 occupancy: 1 collections: 1 last_copies: 1 last_secs: 0.000188 secs_since: 174
Block cache entry stats(count,size,portion): Misc(1,0.00 KB,0%)

** File Read Latency Histogram By Level [default] **

** DB Stats **
Uptime(secs): 174.9 total, 171.9 interval
Cumulative writes: 15M writes, 15M keys, 15M commit groups, 1.0 writes per commit group, ingest: 14.75 GB, 86.35 MB/s
Cumulative WAL: 15M writes, 0 syncs, 15000000.00 writes per sync, written: 14.75 GB, 86.35 MB/s
Cumulative stall: 00:01:16.734 H:M:S, 43.9 percent
Interval writes: 14M writes, 14M keys, 14M commit groups, 1.0 writes per commit group, ingest: 14642.05 MB, 85.16 MB/s
Interval WAL: 14M writes, 0 syncs, 14539109.00 writes per sync, written: 14.30 GB, 85.16 MB/s
Interval stall: 00:01:16.734 H:M:S, 44.6 percent
Write Stall (count): write-buffer-manager-limit-stops: 0